 [
    {
        "id": 88604,
        "date": "2022-04-24T18:49:42",
        "date_gmt": "2022-04-24T13:19:42",
        "guid": {
            "rendered": "https://shop.teamsg.in/?p=88604"
        },
        "modified": "2022-04-24T18:49:42",
        "modified_gmt": "2022-04-24T13:19:42",
        "slug": "kl-rahul-the-trendsetter",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/kl-rahul-the-trendsetter/",
        "title": {
            "rendered": "KL Rahul: The Trendsetter"
        },
        "content": {
            "rendered": "<p>KL Rahul has been one of the great  superstars of Indian Cricket in the recent past, establishing himself at the International Level in Tests, ODIs, T20Is and has played some crucial innings in the IPL. Born on 18th April 1992, Rahul is one of the most prolific batters in recent times. </p>\n<p>He made his debut for India in 2014 vs Australia, where he scored a 100 in the 2nd innings of the test match and helped India draw the game.</p>\n<p>Rahul has been through a lot of ups and downs in his career. In the Initial Days of his career, Rahul was in and out of the Indian Team due to inconsistent performances and was dropped out of the Test Team in 2019 due to a poor run in Australia Tests. Rahul never gives up in challenging situations in his life and always knows how to bounce back. </p>\n<p>After 2019, Rahul has been a different player for India in all formats and has performed reasonably well for India as an opener and middle-order batsman in ODI&#8217;s. Rahul&#8217;s versatility and ability to bat anywhere have been his biggest strength and play according to the Team&#8217;s need. Rahul&#8217;s consistent performances have resulted in being the vice-captain of the Indian Team in all formats.</p>\n<p>Rahul has consistently performed for India and his IPL franchise Punjab Kings. Being the orange cap in the 2020 IPL season, this year was also great for the swashbuckling opener, smashing 98 runs off 43 Balls in the last league game vs CSK. Rahul finished the 2021 season as the 3rd highest run-getter of the tournament with 626 runs in 13 Games. </p>\n<p>2021 has been a good year for Rahul, as he has played some memorable knocks this year, one being 129 vs England in Lords in the 2nd test, which will be one of the most special innings. He has been India&#8217;s best performer in the T20 format as he has a strike rate of 142.5 and an average of nearly 40.  </p>\n<p>One of the main factors of KL Rahul&#8217;s success is SG Bats which have been with him in his highs and lows as a cricketer and have been like his companion for every life situation. SG has played a vital part in the immense growth of KL Rahul as a cricketer.</p>\n<p>SG has been an integral part of Many Cricketers worldwide and is one of the main reasons for their successful careers.</p>\n<p>Rahul will now be leading the Lucknow Supergiants in this year&#8217;s IPL, and now it will be exciting to see how he leads a new franchise that is starting from scratch. SG wishes him all the best for his future endeavors.</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>KL Rahul has been one of the great superstars of Indian Cricket in the recent past, establishing himself at the International Level in Tests, ODIs, T20Is and has played some crucial innings in the IPL. Born on 18th April 1992, Rahul is one of the most prolific batters in recent times. He made his debut [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/88604"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=88604"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/88604/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=88604"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=88604"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=88604"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    },
    {
        "id": 88600,
        "date": "2022-04-24T18:48:09",
        "date_gmt": "2022-04-24T13:18:09",
        "guid": {
            "rendered": "https://shop.teamsg.in/?p=88600"
        },
        "modified": "2022-04-24T18:48:09",
        "modified_gmt": "2022-04-24T13:18:09",
        "slug": "ishan-kishan-the-rising-superstar",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/ishan-kishan-the-rising-superstar/",
        "title": {
            "rendered": "Ishan Kishan-The Rising Superstar"
        },
        "content": {
            "rendered": "<p>Ishan Kishan is a left-handed Indian Batsman who plays for India and Mumbai Indians in the IPL. Ishan is a swashbuckling hitter who can give explosive starts to a team when he is opening the batting for India or Mumbai. Ishan also captained the IndiaU19 Team in 2016, where India finished as runners-up after losing to West Indies in the final.</p>\n<p>Ishan made his debut for India in 2021 in the T20I series vs England, as he had his best IPL season in 2020, scoring 516 runs in 14 games at an average of 57.33 and playing a massive part in Mumbai winning the title in 2020. Ishan is pocket-sized dynamite and can change the game anytime with his attacking abilities.</p>\n<p>Ishan&#8217;s best IPL innings came against RCB in 2020, where he smashed 99 off just 58 balls and nearly won the game for Mumbai that day. His partnership with Kieron Pollard brought Mumbai back into the game, which seemed like a dead rubber before.</p>\n<p>Ishan scored a 50 on his T20I debut vs England in Ahmedabad, which grabbed the eyeballs of all the selectors and the management of the Indian Team, and his knock helped India win the match easily by seven wickets. His consistent performances in the IPL and India earned him a spot for the T20 World Cup 2021, where he got selected as a backup wicketkeeper and an opening batsman. </p>\n<p>Since 2021, Ishan has been a regular part of the Indian T20 Squad and has performed well whenever he has got an opportunity to play. Also, He was the most expensive player in this year&#8217;s IPL Mega Auction, bagging a price of 15.25 Crores which was one of the highest ever bids in the history of IPL.</p>\n<p> SG IK Player Bat features:<br />\n●\tWorld&#8217;s finest &#038; rare top grade English Willow<br />\n●\tCustom-made to meet IK&#8217;s requirement<br />\n●\tThick Edges and complete profile<br />\n●\tIt comes with a coffin bat case, specially designed for the bat<br />\n●\tLight pick up and monstrous ping<br />\n●\tIt has 10-13 Straight Grains<br />\n●\tSpecial Scale Grip for the Bat Handle- for control and comfort, 12 pieces Sarawak Combination Cane Handle for Shock Absorption and Power Hitting.<br />\n●\tSuper Rebound Quality. </p>\n<p>SG IK Pro is a bat in high demand these days because of the increasing popularity of Ishan Kishan amongst the young generation who want to pursue cricket in future. </p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>Ishan Kishan is a left-handed Indian Batsman who plays for India and Mumbai Indians in the IPL. Ishan is a swashbuckling hitter who can give explosive starts to a team when he is opening the batting for India or Mumbai. Ishan also captained the IndiaU19 Team in 2016, where India finished as runners-up after losing [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/88600"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=88600"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/88600/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=88600"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=88600"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=88600"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    },
    {
        "id": 86095,
        "date": "2022-03-16T11:02:23",
        "date_gmt": "2022-03-16T05:32:23",
        "guid": {
            "rendered": "https://shop.teamsg.in/?p=86095"
        },
        "modified": "2022-03-16T11:07:37",
        "modified_gmt": "2022-03-16T05:37:37",
        "slug": "hardik-pandya-the-x-factor",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/hardik-pandya-the-x-factor/",
        "title": {
            "rendered": "Hardik Pandya: The X Factor"
        },
        "content": {
            "rendered": "<p>Hardik Pandya is an Indian All-Rounder who plays for India and is the captain of Gujarat Titans in the IPL. Hardik can change the game at his own will and has power-hitting capabilities, and is also handy with the ball.</p>\n<p>Hardik made his Debut for India in 2016 in the T20I series vs Australia, as he had a stellar IPL season in 2015 for the Mumbai Indians and played a massive part in helping Mumbai win their 2nd IPL title in 2015. Hardik is a proven match-winner and has won many matches for India with his all-around abilities.</p>\n<p>Hardik&#8217;s best performance for India came in 2017, in the final between India and Pakistan. He smashed 76 runs off just 42 balls and gave a glimmer of hope to Indian Fans, which India eventually lost by a massive margin of 180 runs. In many instances, Hardik has played some crucial cameos for Indian Team and Mumbai Indians.</p>\n<p>His best IPL innings came in the 2019 season vs Kolkata Knight Riders Hardik Pandya, and Mumbai Indians confronted a challenging run chase. They were left with 233 to pursue following an Andre Russell attack. Coming in at No. 6, Hardik made an honest effort to bring his side back home, pulverizing the KKR bowlers. Sadly, it wasn&#8217;t enough. His 91 off 34 was a dazzling display of force and power-hitting and remembered by every fan in the stadium.</p>\n<p>After the 2019 World Cup, Hardik has been in and out of the Indian Team and has not been bowling due to a back injury. He has played as a proper batsman for the past two years and rarely bowled.</p>\n<p>He has had some ordinary performances in the IPL and for India in the past year as he was continuously struggling with his back injury, which later affected his game. After the 2021 T20 World Cup, Hardik focused on excelling full fitness to bowl efficiently and playing as a good All-rounder. He will be playing in the IPL, where he will captain the Gujarat Titans, the newest Team in the league.</p>\n<p>Savage Xtreme English Willow Cricket Bat is suitable for the all-around type of play skills. It is the choice of Hardik Pandya and many international players.</p>\n<p>Savage Xtreme English Willow Cricket Bat contains 6 to 8 straight and clear grains. In this SG Bat, the sweet spot is mid to low, which is very helpful to manage or control the bat&#8217;s weight. The bat is a complete back profile with no concavity.</p>\n<p>SG used a flat bat profile, giving shots extra punch and more direction. It is a unique combination of power and control. The selection of Bats and Gears plays a considerable role in a cricketer&#8217;s life, as the right gear and bat helps the player give their best performance for the Team. SG has done it for many years and has been the reason for the success of many Indian and International Players.</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>Hardik Pandya is an Indian All-Rounder who plays for India and is the captain of Gujarat Titans in the IPL. Hardik can change the game at his own will and has power-hitting capabilities, and is also handy with the ball. Hardik made his Debut for India in 2016 in the T20I series vs Australia, as [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/86095"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=86095"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/86095/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=86095"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=86095"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=86095"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    },
    {
        "id": 77579,
        "date": "2021-10-25T09:21:59",
        "date_gmt": "2021-10-25T03:51:59",
        "guid": {
            "rendered": "http://shop.teamsg.in/?p=77579"
        },
        "modified": "2021-10-25T09:22:49",
        "modified_gmt": "2021-10-25T03:52:49",
        "slug": "cricket-in-a-crowded-place",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/cricket-in-a-crowded-place/",
        "title": {
            "rendered": "Cricket in a crowded place!"
        },
        "content": {
            "rendered": "<p class=\"v1gmail-p1\">Can you imagine a cricket facility at the heart of madding crowd in between East Delhi&#8217;s Preet Vihar and Laxmi Nagar — next to the hustle-bustle of the red-light traffic? Bharti Public School at Swastsya Vihar provides you with the best facilities in such a crowded surrounding. Besides having a smiling coach in Sachin Aggarwal, this academy has an indoor net facility to ensure that the students aren&#8217;t out of action even during the monsoon months.</p>\n<p class=\"v1gmail-p1\">A rare place indeed. That is because the trainees are wearing a smile on their faces even while doing their fielding drill. &#8220;I put a lot of onus on fielding. I tell them that catches win matches, and I can&#8217;t compromise on this. If your team doesn&#8217;t field well, you lose a game. It is an important part of the game today. You can&#8217;t ignore it. So, fitness is also an important aspect of the game that the kids should take it seriously,&#8221; Sachin told SGTV.</p>\n<p><iframe loading=\"lazy\" title=\"Sachin Aggarwal (Former cricketer, coach)\" width=\"980\" height=\"551\" src=\"https://www.youtube.com/embed/GZpngtaU0cE?feature=oembed&#038;enablejsapi=1&#038;origin=http://shop.teamsg.in\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p class=\"v1gmail-p1\">The students here also get to chat with the coaches right after their session. &#8220;I talk to the kids for five minutes. I ask them about their doubts. I want them to get back home with a clear mind. At times, some kids ask awkward questions too. One of them asked me where the international players throw their chewing gums? I try and answer them as much as I can. If I don&#8217;t talk to them, how will I know their minds? It is important to understand their emotions,&#8221; Sachin said.</p>\n<p class=\"v1gmail-p1\">The former club level cricket, Sachin, then made it clear that if someone wants to be a coach, he should complete the BCCI&#8217;s Level 1 and Level 2 coaching to offer the best help to the cricketers. &#8220;Since I am a certified Level II coach, I can give a solution for any technical problem because of my Level II certification. You need to know first before teaching the youngsters,&#8221; Sachin said while adding that the journey of being a student of the game never ends.</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>Can you imagine a cricket facility at the heart of madding crowd in between East Delhi&#8217;s Preet Vihar and Laxmi Nagar — next to the hustle-bustle of the red-light traffic? Bharti Public School at Swastsya Vihar provides you with the best facilities in such a crowded surrounding. Besides having a smiling coach in Sachin Aggarwal, [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77579"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=77579"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77579/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=77579"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=77579"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=77579"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    },
    {
        "id": 77410,
        "date": "2021-10-19T12:44:06",
        "date_gmt": "2021-10-19T07:14:06",
        "guid": {
            "rendered": "http://shop.teamsg.in/?p=77410"
        },
        "modified": "2021-10-20T11:49:04",
        "modified_gmt": "2021-10-20T06:19:04",
        "slug": "how-to-stay-as-a-student-of-the-game-forever",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/how-to-stay-as-a-student-of-the-game-forever/",
        "title": {
            "rendered": "How to stay as a student of the game forever!"
        },
        "content": {
            "rendered": "<p class=\"v1gmail-p1\">Does a good student make a successful cricketer? Reputed coach Arun Bharadwaj, who has nurtured thousands of talent at Delhi&#8217;s own National Stadium, says &#8220;being a good student of the game&#8221; is the only way forward. &#8220;You have to be a perpetual student of the game. Be it a player or a coach &#8212; it is a never-ending journey,&#8221; Bharadwaj told SGTV.</p>\n<p><iframe loading=\"lazy\" title=\"Arun Bhardwaj (cricket coach)\" width=\"980\" height=\"551\" src=\"https://www.youtube.com/embed/lomi_nNN8lY?start=1200&#038;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p class=\"v1gmail-p2\">&#8220;Excellence is also a journey, and when you set yourself up on that journey, you have to study all aspects of the game. There are technical,<span class=\"v1gmail-Apple-converted-space\">  </span>physical, and mental aspects, and you have to address these areas to do your job adequately. It is important for the players and coaches to study all these very fascinating aspects,&#8221; Bharadwaj, a former teammate of Mohinder Amaranth in his Under-19 days, said.</p>\n<p class=\"v1gmail-p2\">He then said he loves studying books &#8212; the MCC coaching manuals to the Art of Cricket written by Sir Donald Bradman. &#8220;I remember Chetan Chauhan getting me a book from Australia during the 1979 series on national cricket coaching. Hunger and desire are important to learn more about the game. People will be ready to help you,&#8221; he reminisced.</p>\n<p class=\"v1gmail-p2\">Why is cricket a side-on game? &#8220;If you want to see a successful batsman, you have to be a side-on batsman. Only with a side-on position, a straight bat shot is possible. You can meet the ball below your head, you can play on both sides of the wickets, you can judge the merit of the ball, and you can take effective and evasive action against bouncers because you give the ball a small target to hit your body. Once you square up, the bouncer target becomes big,&#8221; Bharadwaj explained.</p>\n<p class=\"v1gmail-p2\">Therefore, one has to practice diligently to become a good cricketer. Because it is unnatural for the body to play a game in a side-on position rather than being open-chested &#8211; be it while batting, bowling or fielding.<span class=\"v1gmail-Apple-converted-space\"> </span></p>\n<p class=\"v1gmail-p2\">So, how does one describe a late out-swinger? &#8220;Late out-swing is that delivery which swings away from a batsman in the last yard of its strike,&#8221; Bharadwaj said minutes before signing off.</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>Does a good student make a successful cricketer? Reputed coach Arun Bharadwaj, who has nurtured thousands of talent at Delhi&#8217;s own National Stadium, says &#8220;being a good student of the game&#8221; is the only way forward. &#8220;You have to be a perpetual student of the game. Be it a player or a coach &#8212; it [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77410"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=77410"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77410/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=77410"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=77410"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=77410"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    },
    {
        "id": 77407,
        "date": "2021-10-19T12:40:05",
        "date_gmt": "2021-10-19T07:10:05",
        "guid": {
            "rendered": "http://shop.teamsg.in/?p=77407"
        },
        "modified": "2021-10-19T12:40:05",
        "modified_gmt": "2021-10-19T07:10:05",
        "slug": "gursharan-still-nostalgic-about-his-benefit-match",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/gursharan-still-nostalgic-about-his-benefit-match/",
        "title": {
            "rendered": "Gursharan still nostalgic about his benefit match"
        },
        "content": {
            "rendered": "<p class=\"v1gmail-p2\">It was in 2005 when Sachin Tendulkar took centre stage at the Ferozeshah Kotla in the Capital and the occasion was the benefit match for former Delhi and Punjab cricketer — Gursharan Singh. It was perhaps a one-off time when Tendulkar decided against not leaving the crease even after being adjudged out. It was simply because he came to entertain the crowd and he did it in his typical style.</p>\n<p class=\"v1gmail-p3\">More than 16 years later, Gursharan Singh is still nostalgic about that memorable game. And why not? The who&#8217;s who of Indian cricket attended the event — Sourav Ganguly, VVS Laxman, MS Dhoni, Yuvraj Singh, Anil Kumble, Ajay Jadeja to Virender Sehwag.</p>\n<p class=\"v1gmail-p3\">&#8220;Everyone came to play my benefit match. I remember Jadeja telling me that he felt nice to hear Sourav Ganguly came all the way to play that match for you. Sachin had his birthday two days before that game, and he promised me that he would turn up for the match. It is their greatness that they all came to play at my benefit match,&#8221; Gursharan told SGTV.</p>\n<p><iframe loading=\"lazy\" title=\"Gurusharan Singh (Former Indian cricketer)\" width=\"980\" height=\"551\" src=\"https://www.youtube.com/embed/9wOMSPBCjR8?start=435&#038;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p class=\"v1gmail-p3\">This match also saw a young and emerging MS Dhoni giving out his phone numbers innocently to journalists and realizing his mistake later. Recalling that moment, Gursharan said: &#8220;Players also need to have their privacy. When you become famous and doing well, more people want to talk to you.&#8221;</p>\n<p class=\"v1gmail-p4\"><span class=\"v1gmail-Apple-converted-space\"> </span></p>\n<p class=\"v1gmail-p4\">But Gursharan has no regret about not playing that many games for India. &#8220;I gave my best shot,&#8221; he said while adding that the game teaches you to stay honest all through.</p>\n<p class=\"v1gmail-p3\">\n<p class=\"v1gmail-p3\">Otherwise, how on earth would you explain Gursharan Singh telling a schoolboy Murali Karthik that he would play for India one day. &#8220;Murali&#8217;s release reminded me so much of Maninder Singh. The way Karthik&#8217;s deliveries used to drift, turn and bounce, he displayed exceptional skills. I knew there, and then, Murali Karthik could play for India, and he did,&#8221; Gursharan, who is the batting coach of the Delhi senior state team, added.</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>It was in 2005 when Sachin Tendulkar took centre stage at the Ferozeshah Kotla in the Capital and the occasion was the benefit match for former Delhi and Punjab cricketer — Gursharan Singh. It was perhaps a one-off time when Tendulkar decided against not leaving the crease even after being adjudged out. It was simply [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77407"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=77407"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77407/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=77407"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=77407"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=77407"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    },
    {
        "id": 77198,
        "date": "2021-10-13T11:04:02",
        "date_gmt": "2021-10-13T05:34:02",
        "guid": {
            "rendered": "http://shop.teamsg.in/?p=77198"
        },
        "modified": "2021-10-13T15:28:48",
        "modified_gmt": "2021-10-13T09:58:48",
        "slug": "todays-cricket-is-all-about-all-rounds-says-ishan-kishans-coach-uttam",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/todays-cricket-is-all-about-all-rounds-says-ishan-kishans-coach-uttam/",
        "title": {
            "rendered": "Today&#8217;s cricket is all about all-rounds, says Ishan Kishan&#8217;s coach Uttam"
        },
        "content": {
            "rendered": "<p class=\"v1gmail-p2\">How often do you see a cricket team winning a tournament without an all-rounder? Not so often at all. It is perhaps unthinkable to have a team without an all-rounder, and Ishan Kishan&#8217;s childhood coach Uttam Mazumdar can&#8217;t agree more. He said that Ishan&#8217;s skill set is also wicket-keeping other than smashing the ball all over the park. &#8220;He is a pocket dynamite,&#8221; Uttam said while talking to SGTV&#8217;s YouTube channel.</p>\n<p><iframe loading=\"lazy\" title=\"Uttam Mazumdar (Coach of Ishan Kishan)\" width=\"980\" height=\"551\" src=\"https://www.youtube.com/embed/AuQq3RKP9_U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p class=\"v1gmail-p1\">&#8220;Today cricket is all about all-rounders. We know Ishan as a wicket-keeper, but we didn&#8217;t see him behind the stumps for a long time till in the recent match. He showed a lot of confidence behind the stumps. He is a natural wicket-keeper, and he is a different player once he is doing both as a wicket-keeper and batsman,&#8221; Uttam said while talking about the importance of all-rounders in the team.</p>\n<p class=\"v1gmail-p1\">Then he added: &#8220;Ishan has a Dhoni Bhai touch to his style of cricket. They are both from Jharkhand and have a lot in common. If you are keeping well behind the stumps, it will automatically come in handy when you are batting.&#8221;</p>\n<p class=\"v1gmail-p1\">So, how to get out from purple patches? Uttam tells his favorite student Ishan to keep it simple all the time. &#8220;I keep telling Ishan to keep calm. Ups and downs would be there, but you can&#8217;t be thinking negatively. Your basics should be good, and always try to play your natural game,&#8221; Uttam said.</p>\n<p class=\"v1gmail-p1\">Is he ready to give us more Ishan Kishan? &#8220;I am working hard towards it. Like everyone when I see talents, I get excited like the way I felt when I saw Ishan for the first time,&#8221; Uttam added.</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>How often do you see a cricket team winning a tournament without an all-rounder? Not so often at all. It is perhaps unthinkable to have a team without an all-rounder, and Ishan Kishan&#8217;s childhood coach Uttam Mazumdar can&#8217;t agree more. He said that Ishan&#8217;s skill set is also wicket-keeping other than smashing the ball all [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77198"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=77198"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77198/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=77198"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=77198"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=77198"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    },
    {
        "id": 77196,
        "date": "2021-10-13T11:03:15",
        "date_gmt": "2021-10-13T05:33:15",
        "guid": {
            "rendered": "http://shop.teamsg.in/?p=77196"
        },
        "modified": "2021-10-14T10:34:55",
        "modified_gmt": "2021-10-14T05:04:55",
        "slug": "how-virat-kohli-respects-his-coach",
        "status": "publish",
        "type": "post",
        "link": "https://shop.teamsg.in/how-virat-kohli-respects-his-coach/",
        "title": {
            "rendered": "How Virat Kohli respects his coach!"
        },
        "content": {
            "rendered": "<p>How to say thank you to a coach? Ask Indian captain Virat Kohli, and he will tell you more. For now, his coach Raj Kumar Sharma revealed it all on how Virat treats him like his own.</p>\n<p>&#8220;When the second wave came, my wife and I were affected by covid. I didn&#8217;t tell Virat. His brother came to know, and he told him about it. It was a scary situation in Delhi. There was no bed in the city. He was in England, and he was so concerned with my health. He spoke to the owner of a big hospital in Delhi. He booked a VIP room for me in that hospital. He told the management that he would need that room at any cost for my sir. Every day he was calling the doctor. Virat was calling me as well in the morning and evening. He is so caring, so humble, and so respectful. If and when he meets the elders, he respects them. He loves children. He is a good human being,&#8221; are the words of Raj Kumar Sharma while talking to SG TV.</p>\n<p><iframe loading=\"lazy\" title=\"Rajkumar Sharma (Virat Kohli&#039;s coach)\" width=\"980\" height=\"551\" src=\"https://www.youtube.com/embed/o-afCwHEmUA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p>Raj Kumar also said that his best moment as far as cricket is concerned is when Kohli got picked for India. &#8220;Virat is a very confident player. Imagine the first time he led the Test team, and the winning target is 400 plus runs. Any captain will tell you that we have to save the Test match. But look at Virat. He said that India would chase, and he almost made it possible,&#8221; the coach of the Delhi team said while adding that excuses don&#8217;t exist on great players like Virat Kohli.</p>\n<p>Highlighting more on his qualities, the coach also stressed the need to be a good human being to become a player of repute, and all the talent won&#8217;t take you anywhere without your teammates. &#8220;Virat is so positive and aggressive. I feel that his aggression is his strength. He gives it back to the opposition. The Aussies used to ridicule the Indian cricketer. If someone used to sledge an Indian cricketer, he used to get involved. I asked why he was doing that. To which he said that they are my players. Virat is so caring and concerned about his players. He takes them along, and the team respects him,&#8221; Raj Kumar Sharma said before signing off.</p>\n",
            "protected": false
        },
        "excerpt": {
            "rendered": "<p>How to say thank you to a coach? Ask Indian captain Virat Kohli, and he will tell you more. For now, his coach Raj Kumar Sharma revealed it all on how Virat treats him like his own. &#8220;When the second wave came, my wife and I were affected by covid. I didn&#8217;t tell Virat. His [&hellip;]</p>\n",
            "protected": false
        },
        "author": 1,
        "featured_media": 0,
        "comment_status": "open",
        "ping_status": "open",
        "sticky": false,
        "template": "",
        "format": "standard",
        "meta": {
            "_mi_skip_tracking": false
        },
        "categories": [
            1
        ],
        "tags": [],
        "image_feature": null,
        "author_name": "sgsports",
        "_links": {
            "self": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77196"
                }
            ],
            "collection": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts"
                }
            ],
            "about": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/types/post"
                }
            ],
            "author": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/users/1"
                }
            ],
            "replies": [
                {
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/comments?post=77196"
                }
            ],
            "version-history": [
                {
                    "count": 0,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/posts/77196/revisions"
                }
            ],
            "wp:attachment": [
                {
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/media?parent=77196"
                }
            ],
            "wp:term": [
                {
                    "taxonomy": "category",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/categories?post=77196"
                },
                {
                    "taxonomy": "post_tag",
                    "embeddable": true,
                    "href": "https://shop.teamsg.in/wp-json/wp/v2/tags?post=77196"
                }
            ],
            "curies": [
                {
                    "name": "wp",
                    "href": "https://api.w.org/{rel}",
                    "templated": true
                }
            ]
        }
    }
]
